In [6]:
import pandas as pd
import numpy as np
zoo =pd.read_csv(r"C:\Users\spraj\OneDrive\Desktop\DataAnalytics Nov-24\Modules\Module 403\lesson-403.1 introduction-to-data-analytics-and-statistics\glab\zoo.csv", delimiter = ',')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [8]:
# Task 1 - Pandas count()
# 1 Let’s count the number of rows (the number of animals) in a zoo!
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [10]:
zoo[['animal']].count()

animal    22
dtype: int64

In [12]:
zoo.animal.count()

22

In [14]:
# 2 Let’s calculate the total water_need of the animals!
zoo.water_need.sum()

7650

In [16]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [18]:
# Task 3 - Pandas Data Aggregation #3 and #4: min() and max()
zoo.water_need.min()

80

In [20]:
zoo.water_need.max()

600

In [22]:
# Task 4 - Averages in Pandas: mean() and median()
zoo.water_need.mean()

347.72727272727275

In [24]:
zoo.water_need.median()

325.0

In [26]:
# Task 5 - The Pandas groupby() function
# Task 6 - Pandas groupby() – in action

zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [30]:
zoo.groupby('animal').mean()[['water_need']]  
# –» This returns a DataFrame object.

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [32]:
zoo.groupby('animal').mean().water_need
# –» This returns a Series object.

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [34]:
# Task 7 - Pandas groupby() and count()

zoo.groupby('animal').count()

          uniq_id  water_need
animal
elephant        3           3
kangaroo        3           3
lion            4           4
tiger           5           5
zebra           7           7